SET TEMPPATH=%MUSICPATH%\Battle\Spells
SET FILE=Thunder.mp3
CALL "%MUSICPATH%\soundeffect.bat"

CLS
ECHO.
ECHO    ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»
ECHO    º                                 ~  °      °     °    °    °  ~                                     º
ECHO    º                                 ~    °        °     °    °   ~                                     º
ECHO    º                                 ~   °   °  °     °        °  ~                                     º
ECHO    º                                 ~              °      °      ~                                     º
ECHO    º                                 ~      °   ° °            °  ~                                     º
ECHO    º                                 ~              °      ° °    ~                                     º
ECHO    º                                 ~   °  °         °    °      ~                                     º
ECHO    º                                 ~      °       °    °   °    ~                                     º
ECHO    º                        ÚÄÄÄ¿    ~   °        °               ~    ÚÄÄÄ¿                            º
ECHO    º                        ³   ³    ~     °         °    °       ~    ³   ³                            º
ECHO    º                        ³   ³    ~      °     °          °    ~    ³   ³                            º
ECHO    º                        ÀÄÂÄÙ    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    ÀÄÂÄÙ                            º
ECHO    º                       ÚÄÄÁÄÄ¿                                    ÚÄÄÁÄÄ¿                           º
ECHO    º                       ³     ³                                    ³     ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ÀÂÄÄ³ÂÙ                                    ÀÂ³ÄÄÂÙ                           º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼
ECHO.
TIMEOUT /T 2 > nul

SET TEMPPATH=%MUSICPATH%\Earthquake
SET FILE=Earthquake.mp3
CALL "%MUSICPATH%\soundeffect.bat"
CLS
ECHO.
ECHO    ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»
ECHO    º                                 ~  °      °   ° °    °    °  ~                                     º
ECHO    º                                 ~  ° °   °  ° °   ° °    °   ~                                     º
ECHO    º                                 ~   °   °  °  ° °°    °   °  ~                                     º
ECHO    º                                 ~   °°    °   °  °°  °  °    ~                                     º
ECHO    º                                 ~   °   °   ° °°  ° ° °   °  ~                                     º
ECHO    º                                 ~  °°   ° °  ° °    ° ° °    ~                                     º
ECHO    º                                 ~ ° °  °   °     °    °      ~                                     º
ECHO    º                                 ~   °  °    °  °    °   °    ~                                     º
ECHO    º                        ÚÄÄÄ¿    ~   °   °    °  °   °°  ° °  ~    ÚÄÄÄ¿                            º
ECHO    º                        ³   ³    ~  °  °   °     °    °  °    ~    ³   ³                            º
ECHO    º                        ³   ³    ~ °    °     °   °  °   °  ° ~    ³   ³                            º
ECHO    º                        ÀÄÂÄÙ    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    ÀÄÂÄÙ                            º
ECHO    º                       ÚÄÄÁÄÄ¿                                    ÚÄÄÁÄÄ¿                           º
ECHO    º                       ³     ³                                    ³     ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ÀÂÄÄ³ÂÙ                                    ÀÂ³ÄÄÂÙ                           º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼
ECHO.
TIMEOUT /T 2 > nul

SET TEMPPATH=%MUSICPATH%\Earthquake
SET FILE=Earthquake.mp3
CALL "%MUSICPATH%\soundeffect.bat"
CLS
ECHO.
ECHO    ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»
ECHO    º                                 ~  ° ° ° °° ° ° °  ° °   °°  ~                                     º
ECHO    º                                 ~  ° ° °° ° ° ° ° ° °  ° ° ° ~                                     º
ECHO    º                                 ~  °°  ° ° °° ° °° °  °   °  ~                                     º
ECHO    º                                 ~ ° °°  ° °  °°  °°  °  °    ~                                     º
ECHO    º                                 ~   ° ° ° ° ° °°  ° ° °   °  ~                                     º
ECHO    º                                 ~  °°   ° °  ° ° °  ° ° ° °  ~                                     º
ECHO    º                                 ~ ° °  °  °° °°° ° °  ° °° ° ~                                     º
ECHO    º                                 ~   ° °° °° ° °°  ° °   °    ~                                     º
ECHO    º                        ÚÄÄÄ¿    ~   ° ° °° ° °  ° ° °°° ° °  ~    ÚÄÄÄ¿                            º
ECHO    º                        ³   ³    ~  °  °   °  ° °° ° °°  °    ~    ³   ³                            º
ECHO    º                        ³   ³    ~ °    °   ° °  °°  °   °  ° ~    ³   ³                            º
ECHO    º                        ÀÄÂÄÙ    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    ÀÄÂÄÙ                            º
ECHO    º                       ÚÄÄÁÄÄ¿                                    ÚÄÄÁÄÄ¿                           º
ECHO    º                       ³     ³                                    ³     ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ÀÂÄÄ³ÂÙ                                    ÀÂ³ÄÄÂÙ                           º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼
ECHO.
TIMEOUT /T 2 > nul

CLS
ECHO.
ECHO    ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                                 ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~                                     º
ECHO    º                        ÚÄÄÄ¿    ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~    ÚÄÄÄ¿                            º
ECHO    º                        ³   ³    ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~    ³   ³                            º
ECHO    º                        ³   ³    ~°°°°°°°°°°°°°°°°°°°°°°°°°°°°~    ³   ³                            º
ECHO    º                        ÀÄÂÄÙ    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    ÀÄÂÄÙ                            º
ECHO    º                       ÚÄÄÁÄÄ¿                                    ÚÄÄÁÄÄ¿                           º
ECHO    º                       ³     ³                                    ³     ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ³   ³ ³                                    ³ ³   ³                           º
ECHO    º                       ÀÂÄÄ³ÂÙ                                    ÀÂ³ÄÄÂÙ                           º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    º                        ³   ³                                      ³   ³                            º
ECHO    ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼
ECHO.
TIMEOUT /T 2 > nul