CLS
ECHO.
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                              บ
ECHO    บ                                              บ
ECHO    บ                                              บ
ECHO    บ  ษออออออออออออออออออออออออออออออออออป ษออออออบ
ECHO    บ  บ  ÛÛ        ฒฒฒ                   บ บ ฐฐฐ  บ
ECHO    บ  บ  ÛÛ  ฐฐฐ   ฒฒฒ  ฑ  Ü       ฑฑ    บ บ ฐฐฐ  บ
ECHO    บ  บ  ÛÛ  ฐฐฐ   ฒฒฒ  ฑ  Û ฺฤฤฤฟ ฑฑ  ฐ บ บ ฐฐฐ  บ
ECHO    บ  บ  ÛÛ  ฐฐฐ   ฒฒฒ  ฑ  Û ณO  ณ ฑฑ  ฐ บ บ ฐฐฐ  บ
ECHO    บ  ฬออออออออออออออออออออออร   ณอออออออน ฬออออออบ
ECHO    บ  บ ฑฑ        ฒ     ฒฒ   ภฟ ฺู    Ü  บ บ  ฒ   บ
ECHO    บ  บ ฑฑ   ฐฐ   ฒ  Ü  ฒฒ  ฺฤู ภฤฟ   Û  บ บ  ฒ   บ
ECHO    บ  บ ฑฑ   ฐฐ   ฒ  Û  ฒฒ  ณ     ณ   Û  บ บ  ฒ   บ
ECHO    บ  ฬอออออออออออออออออออออณ     ณออออออน ฬออออออบ
ECHO    บ  บ   ฒ  ฑฑ       ฒฒฒ   ณ ณ   ณ   ฐฐ บ บ ฐฐ   บ
ECHO    บ  บฐ  ฒ  ฑฑ  ฐฐ   ฒฒฒ   ณ ณ   ณ Ü ฐฐ บ บ ฐฐ   บ
ECHO    บ  บฐ  ฒ  ฑฑ  ฐฐ   ฒฒฒ   ณ ณ   ณ Û ฐฐ บ บ ฐฐ   บ
ECHO    บ  ฬอออออออออออออออออออออณ ณ   ณออออออน ฬออออออบ
ECHO    บ  บ ฒ      ฑ  ÜÜ        ภยณฤฤยูฑ     บ บ  ÜÜ  บ
ECHO    บ  บ ฒ  ฐฐ  ฑ  ÛÛ   ฑฑ    ณณ  ณ ฑ  ÜÜ บ บ  ÛÛ  บ
ECHO    บ  บ ฒ  ฐฐ  ฑ  ÛÛ   ฑฑ    ณ   ณ ฑ  ÛÛ บ บ  ÛÛ  บ
ECHO    บ  ศออออออออออออออออออออออณอออณอออออออผ ศออออออบ
ECHO    บ                         ณ   ณ                บ
ECHO    บ                         ณ   ณ                บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.