@ECHO OFF
CALL "%MUSICPATH%\stopmusic.bat"
SET GIRLNAME=Sasha
SET GIRLNAMECAP=SASHA
SET /a GIRLNAMELENGTH = 5
SET GIRLHOUSEVAR=บ   %GIRLNAME%'s   บ
SET GIRLHOUSEVAR1=!GIRLHOUSEVAR:~0,5!
SET GIRLHOUSEVAR2=!GIRLHOUSEVAR:~5,5!
SET GIRLHOUSEVAR3=!GIRLHOUSEVAR:~10!
SET FRIENDNAME=Ron
SET FRIENDNAMECAP=RON
SET /a FRIENDNAMELENGTH = 3
SET FRIENDHOUSEVAR=บ    %FRIENDNAME%'s    บ
SET FRIENDHOUSEVAR1=!FRIENDHOUSEVAR:~0,5!
SET FRIENDHOUSEVAR2=!FRIENDHOUSEVAR:~5,5!
SET FRIENDHOUSEVAR3=!FRIENDHOUSEVAR:~10!
SET /a SCENETOT = 24
SET /a SKIP = 0
SET /a COUNT = 0
:LOOPSTART
SET /a COUNT = %COUNT% + 1
CLS
ECHO.
CALL :SCENE%COUNT%IMAGE
CALL :SCENE%COUNT%TEXT
CALL :CONTROLS
IF %CUTSCENEPROGRESSION% EQU 1 (
	CHOICE /C:012 /N /T:%WAITTIME% /D:1
) ELSE (
	CHOICE /C:012 /N /T:9999 /D:1
)
IF %ERRORLEVEL% EQU 1 (
	SET /a SKIP = 1
) ELSE IF %ERRORLEVEL% EQU 3 (
	IF %COUNT% GTR 1 (
		SET /a COUNT = %COUNT% - 2
	) ELSE (
		SET /a COUNT = %COUNT% - 1
	)
)
IF %SKIP% EQU 1 (
	CALL :CONFIRM
)
IF %SKIP% EQU 1 (
	GOTO :END
)
IF %COUNT% LSS %SCENETOT% (
	GOTO :LOOPSTART
)
:END
ECHO.
CALL "%INITIALRESOURCEPATH%\story.bat"
CALL "%NEWRESOURCEPATH%\initialstory.bat"
SET /a HOMETOWNQUESTPHASE = 0
GOTO :EOF

:CONTROLS
ECHO.
ECHO. 1 - Fast forward
ECHO. 2 - Rewind
ECHO. 0 - Pause, with the option to skip
ECHO.
GOTO :EOF

:CONFIRM
CLS
ECHO.
ECHO Paused. Do you want to skip this cutscene?
ECHO If you haven't already assigned names to the characters then they'll be set to Ron and Sasha.
ECHO.
ECHO. 1 - Yes
ECHO. 0 - No, continue
ECHO.
SET /P SKIP=
IF "%SKIP%" EQU "1" (
	GOTO :EOF
) ELSE IF "%SKIP%" EQU "0" (
	SET /a COUNT = %COUNT% - 1
	GOTO :EOF
) ELSE (
	GOTO :CONFIRM
)
GOTO :EOF


:SCENE1IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE1TEXT
ECHO     %PLAYERNAME%: Gah^^! What a dream...
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE2IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE2TEXT
ECHO     %MOTHERNAME%: %PLAYERNAME%^^! Get up lazy bones^^! Your friends were here earlier^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE3IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE3TEXT
ECHO     %PLAYERNAME%: Yea sure %MOTHERNAME%, I'll be down in a sec
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE4IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE4TEXT
ECHO     %PLAYERNAME%: (Jesus christ, what time is it?)
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE5IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                             ÛÛÛÛÛÛÛÛÛÛ                                             บ
ECHO    บ                                  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                  บ
ECHO    บ                    ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                         บ
ECHO    บ        ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ           บ
ECHO    บ  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ  บ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บ  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ  บ
ECHO    บ        ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ           บ
ECHO    บ                    ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                         บ
ECHO    บ                                  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                  บ
ECHO    บ                                             ÛÛÛÛÛÛÛÛÛÛ                                             บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE5TEXT
ECHO     You open your eyes...
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE6IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE6TEXT
ECHO     %PLAYERNAME%: Ahh that's bright^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE7IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                             ÛÛÛÛÛÛÛÛÛÛ                                             บ
ECHO    บ                                  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                  บ
ECHO    บ                    ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                         บ
ECHO    บ        ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ           บ
ECHO    บ  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ  บ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บ  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ  บ
ECHO    บ        ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ           บ
ECHO    บ                    ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                         บ
ECHO    บ                                  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                  บ
ECHO    บ                                             ÛÛÛÛÛÛÛÛÛÛ                                             บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE7TEXT
ECHO     You open your eyes...
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE8IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                ÛÛÛÛ                                                บ
ECHO    บ                               ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                               บ
ECHO    บ                ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                บ
ECHO    บ          ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ          บ
ECHO    บ      ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ      บ
ECHO    บ   ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ   บ
ECHO    บ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ บ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ บ
ECHO    บ   ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ   บ
ECHO    บ      ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ      บ
ECHO    บ          ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ          บ
ECHO    บ                ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                บ
ECHO    บ                               ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                               บ
ECHO    บ                                                ÛÛÛÛ                                                บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE8TEXT
ECHO     You open your eyes...
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE9IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    บÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE9TEXT
ECHO     %PLAYERNAME%: Right, I'd best get ready and go downstairs
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE10IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                  ณ         ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ         ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ    ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ    ÛÛ   ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ    ÛÛ   ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ณ                ณ         ณ                ณ    ณ                ณ     บ
ECHO    บ                  ณ         ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู         ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู    ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู     บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE10TEXT
ECHO     %PLAYERNAME%: 10am^^! Wow, I really slept in...
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

REM Scenes 11-13 at the top of the stairs

:SCENE11IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                        ณ                           บ
ECHO    บ                                                                        ณ                           บ
ECHO    บ                                                                       ฺมฟ                          บ
ECHO    บ                                                                       ณ ณ                          บ
ECHO    บ                                                                       ณ ณ                          บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE11TEXT
ECHO     %MOTHERNAME%: %PLAYERNAME%, they said that they'd meet you at your friend's house
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE12IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                              ณ                                     บ
ECHO    บ                                                              ณ                                     บ
ECHO    บ                                                             ฺมฟ                                    บ
ECHO    บ                                                             ณ ณ                                    บ
ECHO    บ                                                             ณ ณ                                    บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE12TEXT
ECHO     %PLAYERNAME%: Which friend?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE13IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                    ณ                                               บ
ECHO    บ                                                    ณ                                               บ
ECHO    บ                                                   ฺมฟ                                              บ
ECHO    บ                                                   ณ ณ                                              บ
ECHO    บ                                                   ณ ณ                                              บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE13TEXT
ECHO     %MOTHERNAME%: Thingy from down the road...
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

REM Scenes 14-16 walking down the stairs

:SCENE14IMAGE
CALL "%MISCRESOURCEPATH%\setfriendname.bat"
ECHO.
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                          ฺฤฟ                                                       บ
ECHO    บ                                          ณ ณ                                                       บ
ECHO    บ                                          ภยู                                                       บ
ECHO    บ                                           ณ                                                        บ
ECHO    บ                                         ฤฤลฤฤ                                                      บ
ECHO    บ                                           ณ   ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                           ณ   ณ                                                    บ
ECHO    บ                                          ฺมฟ  ณ                                                    บ
ECHO    บ                                          ณ ณ  ณ                                                    บ
ECHO    บ                                          ณ ณ  ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE14TEXT
ECHO     %PLAYERNAME%: %FRIENDNAME%?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE15IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                   ฺฤฟ         ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                   ณ ณ         ณ                                                    บ
ECHO    บ                                   ภยู         ณ                                                    บ
ECHO    บ                                    ณ          ณ                                                    บ
ECHO    บ                                  ฤฤลฤฤ        ณ                                                    บ
ECHO    บ                                    ณ   ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                    ณ   ณ                                                           บ
ECHO    บ                                   ฺมฟ  ณ                                                           บ
ECHO    บ                                   ณ ณ  ณ                                                           บ
ECHO    บ                                   ณ ณ  ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                                 ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE15TEXT
ECHO     %MOTHERNAME%: That's the one^^! Uncle %UNCLENAME% said he wanted to see you when you woke up, can you
ECHO     please head over there before you see your friends?
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE16IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                            ฺฤฟ         ณ                                                           บ
ECHO    บ                            ณ ณ         ณ                                                           บ
ECHO    บ                            ภยู         ณ                                                           บ
ECHO    บ                           ฤฤลฤฤ        ณ                                                           บ
ECHO    บ                             ณ   ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                             ณ   ณ                                                                  บ
ECHO    บ                            ฺมฟ  ณ                                                                  บ
ECHO    บ                            ณ ณ  ณ                                                                  บ
ECHO    บ                            ณ ณ  ณ                                                                  บ
ECHO    บ                          ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    บ                          ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE16TEXT
ECHO     %PLAYERNAME%: Yea sure, do you know what he wants to see me for?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

REM Scenes 17-18 At the bottom of the stairs

:SCENE17IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ                  ฺฤฟ            ณ                                                                  บ
ECHO    บ                  ณ ณ            ณ                                                                  บ
ECHO    บ                  ภยู            ณ                                                                  บ
ECHO    บ                 ฤฤลฤฤ           ณ                                                                  บ
ECHO    บ                   ณ      ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ                   ณ      ณ                                                                         บ
ECHO    บ                  ฺมฟ     ณ                                                                         บ
ECHO    บ                  ณ ณ     ณ                                                                         บ
ECHO    บ                  ณ ณ     ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE17TEXT
ECHO     %MOTHERNAME%: He said something about lethal weapons training, he's a bit of a nutcase...
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE18IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤบ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                               ณ                                                    บ
ECHO    บ                                        ฺฤฤฤฤฤฤู                                                    บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                        ณ                                                           บ
ECHO    บ                                 ฺฤฤฤฤฤฤู                                                           บ
ECHO    บ       ฺฤฟ                       ณ                                                                  บ
ECHO    บ       ณ ณ                       ณ                                                                  บ
ECHO    บ       ภยู                       ณ                                                                  บ
ECHO    บ      ฤฤลฤฤ                      ณ                                                                  บ
ECHO    บ        ณ                 ฺฤฤฤฤฤฤู                                                                  บ
ECHO    บ        ณ                 ณ                                                                         บ
ECHO    บ       ฺมฟ                ณ                                                                         บ
ECHO    บ       ณ ณ                ณ                                                                         บ
ECHO    บ       ณ ณ                ณ                                                                         บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE18TEXT
ECHO     %PLAYERNAME%: (Lethal weapons training^^!? Uncle %UNCLENAME%'s awesome)
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

REM Scenes 19-20 stationary in the kitchen
:SCENE19IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE19TEXT
ECHO     %PLAYERNAME%: Hello^^! Who was here with %FRIENDNAME% anyway?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE20IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE20TEXT
ECHO     %MOTHERNAME%: It was that girl from down the street, Whatshername...
SET /a WAITTIME = %BASEWAITTIME% + 5
GOTO :EOF

:SCENE21IMAGE
CALL "%MISCRESOURCEPATH%\setgirlname.bat"
ECHO.
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE21TEXT
ECHO     %PLAYERNAME%: %GIRLNAME%^^!?
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF 

:SCENE22IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE22TEXT
ECHO     %MOTHERNAME%: That's the one. The one you've had a crush on for years^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF 

:SCENE23IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE23TEXT
ECHO     %PLAYERNAME%: Shhh^^!
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF 

:SCENE24IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                                             บ
ECHO    บ      ณ                                                                 ฺฤฤฤฤฟ                      บ
ECHO    บ      ณ                          ษออออฟ                                 ณO   ณ                      บ
ECHO    บ      ณ                          บ   Oณ                                 ณ    ณ                      บ
ECHO    บฤฤฤฤฤฤู                          บ    ณ                                 รฤ   ณ                      บ
ECHO    บ                                 บ   ฤด                                 ภฤฟฺฤู                      บ
ECHO    บ                                 บฤฟฺฤู                                ฺฤฤูภฤฤฟ                     บ
ECHO    บ                              ณ ฺบฤูภฤฤฟ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ                               ณ      ณ                     บ
ECHO    บ                              ณ ณบ     ณ   ฺฤฟ                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ   ฤฤฤลฤฤฤณ ั                         ณ  ณ   ณ                     บ
ECHO    บ                              ณ ณ      ณ   ภฤู                         ณ  ณ   ณ                     บ
ECHO    บฤฤฤฤฤฤฤฤฤฤฟ                   ณ ณ      ณอออหอออออออออหอออ              ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ณ      ณ   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ ภฤฤยฤฤฤู   บ         บ                 ณ  ณ   ณ                     บ
ECHO    บ          ณ                   ณ    ภฤฤฤฤฟ  บ         บ                 ภฤยณฤยฤู                     บ
ECHO    บ          ณ                   ภยฤฤฤฤฤยฤฤณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    บ          ณ                    ณ     ณ  ณ  บ         บ                   ณ  ณ                       บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE24TEXT
ECHO     %MOTHERNAME%: You shh^^! Go and see uncle %UNCLENAME%
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF
