@ECHO OFF
IF /I %DIFFICULTY% EQU EASY (
	SET /a ITEM1 = %POTID%
	SET /a ITEM2 = %FIRAITEMID%
	SET /a NUM1 = 5
	SET /a NUM2 = 3
) ELSE (
	SET /a ITEM1 = %POTID%
	SET /a ITEM2 = %WATERITEMID%
	SET /a NUM1 = 2
	SET /a NUM2 = 2
)
SET /a SCENETOT = 47
SET /a SKIP = 0
SET /a COUNT = 0
:LOOPSTART
SET /a COUNT = %COUNT% + 1
CLS
ECHO.
CALL :SCENE%COUNT%IMAGE
CALL :SCENE%COUNT%TEXT
CALL :CONTROLS
IF %CUTSCENEPROGRESSION% EQU 1 (
	CHOICE /C:012 /N /T:%WAITTIME% /D:1
) ELSE (
	CHOICE /C:012 /N /T:9999 /D:1
)
IF %ERRORLEVEL% EQU 1 (
	SET /a SKIP = 1
) ELSE IF %ERRORLEVEL% EQU 3 (
	IF %COUNT% GTR 1 (
		SET /a COUNT = %COUNT% - 2
	) ELSE (
		SET /a COUNT = %COUNT% - 1
	)
)
IF %SKIP% EQU 1 (
	CALL :CONFIRM
)
IF %SKIP% EQU 1 (
	GOTO :END
)
IF %COUNT% LSS %SCENETOT% (
	GOTO :LOOPSTART
)
:END
ECHO.
SET /a STORY5VERSIONNUM = 1
SET /a PLAYERITEM%ITEM1%NUM = !PLAYER%ITEM1%NUM! + %NUM1%
SET /a PLAYERITEM%ITEM2%NUM = !PLAYER%ITEM2%NUM! + %NUM2% 
SET MAP=TOWN2
SET /a PLAYERXCOORD = 7
SET /a PLAYERYCOORD = 2
GOTO :EOF

:CONTROLS
ECHO.
ECHO. 1 - Fast forward
ECHO. 2 - Rewind
ECHO. 0 - Pause, with the option to skip
ECHO.
GOTO :EOF

:CONFIRM
CLS
ECHO.
ECHO Paused. Do you want to skip this cutscene?
ECHO.
ECHO. 1 - Yes
ECHO. 0 - No, continue
ECHO.
SET /P SKIP=
IF "%SKIP%" EQU "1" (
	GOTO :EOF
) ELSE IF "%SKIP%" EQU "0" (
	SET /a COUNT = %COUNT% - 2
	GOTO :EOF
) ELSE (
	GOTO :CONFIRM
)
GOTO :EOF

:SCENE1IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                            ~ฐฐฐฐ~    \฿฿/~    ~  ~ ณ\          \~                             ~    บ
ECHO    บ    ~~      ~               ~ฐฐฐฐ~ ~  รþþด        ~ ณ \  ~    ~  \                             ~    บ
ECHO    บ          ~_                ~ฐฐฐฐ~    ณÜÜณ ~        ณ  \         /ณ~ ~          ~~                  บ
ECHO    บ         /~ \  /   /\ _     ~ฐฐฐฐ~ ฯ ฺมมมมฟ ฯ       ณ   \      /  ณ                   ~    ~~       บ
ECHO    บ         ณ  ~ ฤ  \   ~ ณ    ~~~~~~ ศอด uu รอผ       ณ~   \   /~   ณ                                 บ
ECHO    บ         ณ /\   \/  /ณ ณ        ~    ณ ~~ ณ         ณ ณ\  \/   /\ ณ    ~   ~                ~       บ
ECHO    บ         ณ/   \ ~ณ  ณณ/  ~      ~    ณ ~~~ณ    ~     \ณณ  ณ  /   \ณ  ~   ~                  ~       บ
ECHO    บ      ~  /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤภยฤฤยูฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/  ~   \                    ~      ~     บ
ECHO    บ   ~   ~/         \ /ฤฤฤฤฤฤฤฤฤฤฟ   ~  บ  บ   ฺฤฤฤฤฤฤฤฤฤ\ /         \           ~       ~            บ
ECHO    บ       /       ~  /ณ           ณ      บ  บ   ณ  \__Ü    ณ\  ~       \  ~          ~~     ~          บ
ECHO    บ     ~/          /~ณ           ณ       ~     ณ  /  ฿    ณ \          \~ ~                           บ
ECHO    บ     ณ\         /  ณ        ~  ณ     \__Ü    ณ     ~    ณ  \         /ณ   ~               ~         บ
ECHO    บ     ณ  \      /   ณ           ณ     /  ฿    ณ       ~  ณ~  \      /  ณ                ~            บ
ECHO    บ     ณ    \   /    ณ~~         ณ ~           ณ          ณ    \   /    ณ             ~          ~    บ
ECHO    บ     ณ      \/ ~/ณ ณ ~         ณ        ~    ณ       ~  \ ณ\  \/      ณ             ~        ~      บ
ECHO    บ    ~ณ       ณ  ณณ/            ณ~            ณ           \ณณ~ ณ      ~ณ         ~                   บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู          ~ ~ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ  ~    ณ ~                   ~       บ
ECHO    บ      \   ~  ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ ~   /                 ~            บ
ECHO    บ        \    ณ /      ~      ~ ณ  /  ฿       ณ              \ ณ    /                     ~          บ
ECHO    บ     ~    \~ ณ/    ~   ~       ณ  ~        ~ ณ ~             \ณ  /                          ~~ ~~   บ
ECHO    บ            \/        ~        ณ  ~      ~   ณ    ~           \/        ~      ~                    บ
ECHO    บ       ~              ~        ณ             ณ      ~                                         ~     บ
ECHO    บ    ~                          ณ             ณ ~         ~      ~     ~                             บ
ECHO    บ              ~       ~        ณ ~    ~      ณ~                                             ~       บ
ECHO    บ             ~                 ณ             ณ                   ~~    ~          ~          ~      บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE1TEXT
SET TEMPPATH=%MUSICPATH%\AttackTown
SET /a STOP = 1
SET /a LOOP = 1
CALL "%MUSICPATH%\startmusic.bat"
ECHO     %PLAYERNAME%: Ugh^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE2IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                            ~ฐฐฐฐ~    \฿฿/          ณ\         ~\      ~           ~    ~          ~บ
ECHO    บ               ~       ~    ~ฐฐฐฐ~    รþþด          ณ \          \   ~    ~ ~        ~   ~  ~       บ
ECHO    บ           _ ~              ~ฐฐฐฐ~    ณÜÜณ ~     ~  ณ  \         /ณ    ~  ~        ~          ~     บ
ECHO    บ         /  \  /   /\ _     ~ฐฐฐฐ~ ฯ ฺมมมมฟ ฯ ~ ~   ณ   \      /  ณ        ~                        บ
ECHO    บ         ณ    ฤ  \     ณ    ~~~~~~ ศอด uu รอผ       ณ    \   /    ณ             ~   ~           ~ ~ บ
ECHO    บ         ณ /\   \/  /ณ ณ     ~~      ณ ~~~ณ         ณ ณ\~ \/ ~ /\ ณ          ~~  ~                  บ
ECHO    บ  ~      ณ/~  \  ณ  ณณ/  ~      ~    ณ ~~ ณ    ~     \ณณ  ณ  /   \ณ                  ~~     ~    ~  บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤภยฤฤยูฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \ ~           ~              ~   ~บ
ECHO    บ        /         \~/ฤฤฤฤฤฤฤฤฤฤฟ      บ  บ   ฺฤฤฤฤฤฤฤฤฤ\ /~    ~   \ ~                              บ
ECHO    บ       /      ~ ~ /ณ           ณ      บ  บ   ณ  \__Ü   ~ณ\          \                               บ
ECHO    บ      /     ~    / ณ ~      ~  ณ       ~     ณ~ /  ฿    ณ \~         \           ~  ~   ~           บ
ECHO    บ     ณ\        ~/  ณ ~    ~    ณ     \__Ü    ณ          ณ  \   ~     /ณ                ~    ~       บ
ECHO    บ     ณ  \      /   ณ           ณ     /  ฿   ~ณ ~        ณ   \      /  ณ               ~           ~ บ
ECHO    บ     ณ    \   / ~  ณ ~~        ณ             ณ          ณ  ~ \   /    ณ                ~ ~          บ
ECHO    บ     ณ      \/~ /ณ ณ  ~        ณ             ณ  ~      ~\ ณ\  \/      ณ   ~     ~           ~     ~~บ
ECHO    บ     ณ       ณ  ณณ/            ณ             ณ           \ณณ~~ณ  ~ ~  ณ            ~        ~       บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู             ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ      ~ณ      ~                      บ
ECHO    บ      \     ~ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü ~     ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /~                             บ
ECHO    บ     ~  \~   ณ /      ~        ณ  /  ฿       ณ   ~          \~ณ    /           ~       ~      ~     บ
ECHO    บ  ~       \  ณ/    ~~          ณ             ณ         ~     \ณ  /                                  บ
ECHO    บ        ~   \/                 ณ  ~          ณ            ~   \/                     ~          ~   บ
ECHO    บ ~     ~                       ณ       ~     ณ               ~                            ~ ~~      บ
ECHO    บ ~                           ~ ณ             ณ             ~                          ~           ~ บ
ECHO    บ                             ~ ณ          ~  ณ           ~     ~                                 ~  บ
ECHO    บ           ~               ~   ณ       ~   ~ ณ           ~       ~               ~              ~   บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE2TEXT
ECHO     %LASTBOSSNAME%: AHHAHHHAHHAHHAHAHAHHHAH^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE3IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ   ~                       ~~ฐฐฐฐ~    \฿฿/         ~ณ\~         \       ~             ~ ~~          บ
ECHO    บ      ~   ~                 ~ฐฐฐฐ~~   รþþด          ณ \          \          ~           ~           บ
ECHO    บ          ~_  ~     ~       ~ฐฐฐฐ~    ณÜÜณ  ~       ณ ~\ ~       /ณ ~     ~             ~      ~    บ
ECHO    บ    ~ ~  /  \  /  ~/\ _     ~ฐฐฐฐ~ ฯ ฺมมมมฟ ฯ       ณ   \      /  ณ           ~                ~    บ
ECHO    บ      ~~ ณ    ฤ  \     ณ    ~~~~~~ ศอด uu รอผ  ~    ณ    \   /    ณ                                 บ
ECHO    บ   ~ ~  ~ณ /\   \/  /ณ ณ             ณ ~~ ณ  ~      ณ~ณ\  \/   /\ ณ                   ~    ~        บ
ECHO    บ         ณ/   \  ณ~ ณณ/      ~       ณ~~~ ณ          \ณณ  ณ  / ~ \ณ   ~       ~                     บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤภยฤฤยูฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/  ~   \         ~                       บ
ECHO    บ  ~     /         \ /ฤฤฤฤฤฤฤฤฤฤฟ  ~   บ  บ  ~ฺฤฤฤฤฤฤฤฤฤ\ /  ~      \        ~ ~~                    บ
ECHO    บ       /          /ณ  ~ ~      ณ~     บ  บ ~ ณ  \__Ü    ณ\~ ~   ~   \                       ~       บ
ECHO    บ      /          /~ณ           ณ     ~  ?    ณ  /  ฿    ณ \     ~    \                    ~         บ
ECHO    บ    ~ณ\         /  ณ           ณ    ~\__Ü    ณ          ณ  \         /ณ           ~                 บ
ECHO    บ     ณ  \    ~ /   ณ    ~      ณ     /~ ฿    ณ          ณ   \      /  ณ             ~   ~  ~        บ
ECHO    บ     ณ ~~ \   /    ณ           ณ ~    ~      ณ          ณ    \   /    ณ  ~               ~          บ
ECHO    บ     ณ      \/~ /ณ ณ           ณ ~  ~        ณ          \ ณ\  \/      ณ          ~   ~    ~         บ
ECHO    บ   ~ ณ       ณ  ณณ/~           ณ             ณ           \ณณ  ณ       ณ   ~                   ~~    บ
ECHO    บ     ณ      ~ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู             ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ ~     ณ   ~                         บ
ECHO    บ  ~  ~\     ~ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ   ~ /                ~      ~~     บ
ECHO    บ        \    ณ /              ~ณ  /  ฿       ณ    ~         \~ณ    /     ~                          บ
ECHO    บ          \  ณ/          ~    ~ณ   ~         ณ         ~~    \ณ  /                   ~              บ
ECHO    บ          ~~\/  ~     ~        ณ             ณ                \/~   ~  ~  ~   ~          ~          บ
ECHO    บ                               ณ             ณ                               ~                      บ
ECHO    บ           ~         ~         ณ             ณ           ~                        ~                 บ
ECHO    บ                               ณ             ณ            ~           ~          ~                  บ
ECHO    บ      ~    ~                   ณ             ณ ~   ~                      ~             ~      ~  ~ บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE3TEXT
ECHO     %PLAYERNAME%: (What?)
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE4IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                 ~          ~ฐฐฐฐ~    \฿฿/          ณ\  ~       \                    ~              บ
ECHO    บ                ~           ~ฐฐฐฐ~    รþþด          ณ \          \                        ~         บ
ECHO    บ           _                ~ฐฐฐฐ~   ~ณÜÜณ      ~   ณ  \~        /ณ  ~                              บ
ECHO    บ    ~ ~  /  \  /~  /\ _     ~ฐฐฐฐ~   ฺมมมมฟ ฯ       ณ~  \      /  ณ                                 บ
ECHO    บ         ณ    ฤ  \     ณ   ~~~~~~~ ษอด uu รอผ    ~ ~ณ    \   /~   ณ~   ~       ~                    บ
ECHO    บ   ~     ณ /\   \/  /ณ ณ~        ~ ฯ ณ ~~~ณ         ณ ณ\  \/   /\ ณ      ~   ~         ~~ ~~        บ
ECHO    บ         ณ/   \  ณ  ณณ/              ณ ~~ ณ      ~   \ณณ~ ณ  /  ~\ณ              ~                  บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤภยฤฤยูฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/ ~    \    ~  ~                         บ
ECHO    บ        /         \ /ฤฤฤฤฤฤฤฤฤฤฟ      บ  บ   ฺฤฤฤฤฤฤฤฤฤ\ /         \          ~    ~          ~     บ
ECHO    บ       /          /ณ           ณ      บ  บ   ณ  \__Ü    ณ\~         \     ~                         บ
ECHO    บ     ~/ ~       ~/ ณ           ณ             ณ  /  ฿    ณ \          \   ~                          บ
ECHO    บ     ณ\ ~    ~  /  ณ      ~    ณ     \__Ü    ณ~         ณ  \    ~  ~ /ณ                          ~  บ
ECHO    บ     ณ  \   ~  /   ณ  ~        ณ~    /  ฿   ~ณ     ~    ณ   \      /  ณ   ~                ~        บ
ECHO    บ   ~ ณ    \   /    ณ           ณ             ณ          ณ    \   /    ณ               ~             บ
ECHO    บ     ณ      \/  /ณ ณ           ณ~            ณ         ~\ ณ\  \/    ~ ณ     ~~~   ~                 บ
ECHO    บ     ณ~      ณ ~ณณ/            ณ  ~   ~      ณ           \ณณ  ณ       ณ       ~               ~     บ
ECHO    บ     ณ      ~ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู ~    ~     ~ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ      ~ณ          ~                  บ
ECHO    บ      \~   ~ ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü   ~   ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /      ~                       บ
ECHO    บ      ~ \    ณ /               ณ  /~ ฿   ~   ณ              \ ณ    /      ~                   ~     บ
ECHO    บ          \  ณ/           ~    ณ             ณ    ~         ~\ณ  /                                  บ
ECHO    บ      ~     \/         ~       ณ             ณ                \/                                ~   บ
ECHO    บ ~                ~        ~   ณ   ~         ณ                         ~       ~ ~       ~        ~ บ
ECHO    บ                              ~ณ             ณ        ~                             ~     ~   ~     บ
ECHO    บ                ~              ณ             ณ    ~    ~                                 ~   ~      บ
ECHO    บ                               ณ             ณ            ~    ~    ~                               บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE4TEXT
ECHO     %LASTBOSSNAME%: WHO'S THIS PRETTY LITTLE THING ON THE FLOOR OVER HERE?
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE5IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ ~                          ~ฐฐฐฐ~                  ณ\          \                                  ~บ
ECHO    บ                     ~    ~ ~ฐฐฐฐ~                  ณ \    ~     \         ~          ~             บ
ECHO    บ           _  ~             ~ฐฐฐ\฿฿/               ~ณ  \         /ณ                           ~     บ
ECHO    บ         /  \  /   /\ _     ~ฐฐฐรþþด          ~  ~ ~ณ   \   ~  /  ณ                                 บ
ECHO    บ      ~  ณ   ~ฤ  \     ณ    ~~~~ณÜÜณ              ~ ณ    \   /    ณ ~                  ~       ~    บ
ECHO    บ         ณ /\  ~\/  /ณ ณ ~   ฯ~ฺมมมมฟ ฯ  ~   ~      ณ ณ\ ~\/~  /\ ณ       ~      ~   ~              บ
ECHO    บ ~ ~     ณ/   \  ณ  ณณ/      ศอด uu~รอผ     ~   ~    \ณณ  ณ  /   \ณ     ~             ~  ~          บ
ECHO    บ ~~  ~   /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤณ ~~ ณฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \                         ~       บ
ECHO    บ        /         \ /ฤฤฤฤฤฤฤฤฤฤณ ~~~ณ   ~    ฺฤฤฤฤฤฤฤฤฤ\ /         \~    ~    ~                     บ
ECHO    บ       /          /ณ        ~  ภยฤฤยู        ณ  \__Ü    ณ\   ~~  ~  \                ~       ~      บ
ECHO    บ   ~  /        ~ / ณ           ณบ  บ  ~ ^^!    ณ  /  ฿    ณ \          \     ~              ~   ~     บ
ECHO    บ     ณ\         /  ณ           ณบ  บ \__Ü    ณ          ณ  \         /ณ   ~     ~  ~ ~    ~         บ
ECHO    บ    ~ณ  \   ~  /   ณ  ~~       ณ     /  ฿    ณ          ณ   \~     /  ณ        ~  ~                 บ
ECHO    บ     ณ    \   /    ณ          ~ณ             ณ         ~ณ    \~  /    ณ         ~         ~         บ
ECHO    บ     ณ      \/  /ณ ณ ~      ~ ~ณ             ณ      ~   \ ณ\  \/      ณ         ~~                  บ
ECHO    บ     ณ       ณ~~ณณ/            ณ         ~   ณ     ~  ~  \ณณ  ณ     ~ ณ     ~                ~      บ
ECHO    บ     ณ       ณ~ ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู           ~ ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ       ณ   ~~                        บ
ECHO    บ ~    \   ~  ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ   ~ /                      ~       บ
ECHO    บ        \    ณ /        ~      ณ  /  ฿       ณ              \ ณ    /  ~                         ~   บ
ECHO    บ       ~  \  ณ/~~              ณ ~  ~        ณ               \ณ  /      ~    ~                   ~  บ
ECHO    บ            \/             ~   ณ    ~        ณ            ~   \/  ~  ~         ~      ~     ~       บ
ECHO    บ                        ~      ณ   ~ ~  ~    ณ                           ~                          บ
ECHO    บ                               ณ             ณ                    ~                     ~           บ
ECHO    บ   ~ ~                ~        ณ             ณ  ~         ~            ~                ~          ~บ
ECHO    บ        ~               ~      ณ    ~        ณ    ~        ~        ~                 ~             บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE5TEXT
ECHO     %PLAYERNAME%: Don't touch her^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE6IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ           ~ ~            ~ ~ฐฐฐฐ~    ~ ~           ณ\ ~      ~ \     ~   ~                   ~     บ
ECHO    บ  ~          ~              ~ฐฐฐฐ~       ~ ~   ~    ณ \  ~   ~   \         ~   ~           ~~~      บ
ECHO    บ           _                ~ฐฐฐ\฿฿/  ~      ~      ณ  \   ~     /ณ         ~                       บ
ECHO    บ         /  \  /   /\ _ ~   ~ฐฐฐรþþด                ณ~  \      /  ณ~                                บ
ECHO    บ         ณ    ฤ~ \     ณ    ~~~~ณÜÜณ   ~      ~     ณ    \   /    ณ                                 บ
ECHO    บ         ณ /\   \/~ /ณ ณ     ฯ ฺมมมมฟ~ฯ            ~ณ ณ\  \/   /\ ณ ~    ~      ~     ~         ~   บ
ECHO    บ         ณ/   \  ณ  ณณ/      ศอด uu รอผ     ~ ~      \ณณ  ณ  /   \ณ                 ~               บ
ECHO    บ         /      \ณ~ ณ/ฤฤฤฤฤฤฤฤฤณ ~~ ณฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \ ~                           ~   บ
ECHO    บ     ~  / ~     ~ \ /ฤฤฤฤฤฤฤฤฤฤณ ~~ ณ     ~ ~ฺฤฤฤฤฤฤฤฤฤ\~/ ~~      \          ~                     บ
ECHO    บ       /       ~  /ณ~~        ~ภยฤฤยู        ณ  \__Ü    ณ\ ~      ~ \                            ~  บ
ECHO    บ  ~   /          / ณ  ~        ณบ  บ   ~     ณ  /  ฿    ณ \          \  ~ ~                       ~ บ
ECHO    บ     ณ\   ~     /  ณ ~         ณบ  บ \__Ü~  ~ณ        ~ ณ  \       ~ /ณ      ~       ~              บ
ECHO    บ     ณ  \      /   ณ           ณ     /  ฿    ณ ~   ~  ~ ณ   \    ~ /~ ณ                   ~ ~       บ
ECHO    บ     ณ ~  \   /    ณ           ณ             ณ     ~ ~  ณ ~ ~\   /    ณ         ~               ~  ~บ
ECHO    บ     ณ      \/  /ณ ณ       ~   ณ~~           ณ          \ ณ\ ~\/ ~    ณ           ~               ~ บ
ECHO    บ     ณ       ณ  ณณ/         ~ ~ณ       ~     ณ      ~    \ณณ  ณ   ~   ณ~                            บ
ECHO    บ  ~  ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู          ~  ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ       ณ                             บ
ECHO    บ      \      ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\ ~ณณ     /      ~   ~          ~        บ
ECHO    บ        \    ณ /               ณ  /  ฿   ~   ณ            ~~\ ณ    /  ~      ~                      บ
ECHO    บ        ~ \  ณ/   ~            ณ             ณ               \ณ  /     ~                 ~          บ
ECHO    บ            \/            ~    ณ             ณ                \/~               ~                   บ
ECHO    บ                           ~   ณ   ~     ~   ณ      ~           ~~     ~             ~~             บ
ECHO    บ ~             ~              ~ณ             ณ      ~            ~             ~    ~               บ
ECHO    บ                               ณ             ณ                           ~   ~  ~            ~      บ
ECHO    บ                   ~     ~     ณ             ณ~                                            ~ ~      บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE6TEXT
ECHO     %LASTBOSSNAME%: SHE WILL MAKE A FINE QUEEN^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE7IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ     ~       ~~  ~          ~ฐฐฐฐ~       ~       ~  ณ\          \ ~       ~       ~          ~      บ
ECHO    บ           ~            ~   ~ฐฐฐฐ~   ~   ~    ~     ณ \     ~    \      ~~          ~    ~          บ
ECHO    บ    ~      _            ~   ~ฐฐฐฐ~      ~ ~         ณ~ \         /ณ                       ~   ~  ~  บ
ECHO    บ         /  \  /   /\ _     ~ฐฐฐฐ~                  ณ   \ ~ ~  /  ณ                                 บ
ECHO    บ ~       ณ    ฤ  \ ~~  ณ  ~ ~~~~~~                  ณ    \  ~/    ณ~                                บ
ECHO    บ         ณ /\   \/  /ณ ณ        \฿฿/            ~   ณ ณ\  \/   /\ ณ                             ~   บ
ECHO    บ       ~ ณ/   \ ~ณ ~ณณ/         รþþด~              ~ \ณณ  ณ ~/~~ \ณ    ~            ~~            ~ บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤณÜÜณฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \   ~ ~           ~               บ
ECHO    บ        /        ~\ /ฤฤฤฤฤฤฤฤฯ ฺมมมมฟ ฯ      ฺฤฤฤฤฤฤฤฤฤ\ /~        \                ~     ~         บ
ECHO    บ       /       ~  /ณ       ~ ศอด uu รอผ      ณ  \__Ü    ณ\          \    ~            ~         ~   บ
ECHO    บ      /     ~    / ณ           ณ ~~ ณ   ^^!  ~ ณ  /~ ฿    ณ \          \    ~ ~                      ~บ
ECHO    บ   ~ ณ\        ~/  ณ     ~     ณ ~~ ณ\__Ü    ณ    ~     ณ ~\      ~  /ณ     ~  ~~    ~       ~      บ
ECHO    บ     ณ  \      /   ณ    ~      ภยฤฤยู/  ฿    ณ          ณ   \~     /  ณ    ~  ~    ~                บ
ECHO    บ  ~  ณ    \ ~ /    ณ           ณบ  บ     ~   ณ          ณ~~  \   / ~  ณ    ~~                       บ
ECHO    บ  ~  ณ      \/  /ณ~ณ       ~   ณบ  บ         ณ          \ ณ\ ~\/      ณ     ~              ~        บ
ECHO    บ     ณ       ณ  ณณ/~           ณ             ณ  ~        \ณณ  ณ       ณ                             บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู             ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ  ~    ณ               ~  ~          บ
ECHO    บ      \  ~   ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü~      ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /                     ~   ~    บ
ECHO    บ    ~ ~ \    ณ /            ~~ ณ  /  ฿ ~     ณ          ~   \ ณ    /                     ~          บ
ECHO    บ          \  ณ/~~         ~    ณ     ~ ~     ณ ~      ~  ~   \ณ  /      ~~                          บ
ECHO    บ            \/~       ~        ณ             ณ  ~        ~    \/              ~~            ~       บ
ECHO    บ                    ~        ~ ณ             ณ                                    ~      ~~ ~       บ
ECHO    บ                             ~ ณ   ~         ณ                ~ ~                 ~              ~~ บ
ECHO    บ            ~                  ณ      ~      ณ                   ~                                  บ
ECHO    บ ~         ~       ~           ณ             ณ             ~    ~     ~                ~~           บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE7TEXT
ECHO     %PLAYERNAME%: Dude, she's 16^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE8IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                            ~ฐฐฐฐ~                  ณ\  ~~     ~\          ~                     ~  บ
ECHO    บ                            ~ฐฐฐฐ~                  ณ \          \                     ~            บ
ECHO    บ           _                ~ฐฐฐฐ~~ ~       ~      ~ณ  \   ~     /ณ                                 บ
ECHO    บ ~    ~  /  \  /   /\ _     ~ฐฐฐฐ~          ~       ณ   \     ~/  ณ                       ~         บ
ECHO    บ ~    ~  ณ    ฤ  \ ~   ณ    ~~~~~~    ~             ณ    \  ~/    ณ                 ~               บ
ECHO    บ         ณ~/\   \/  /ณ ณ   ~  ~ \฿฿/                ณ ณ\  \/   /\ ณ ~        ~                      บ
ECHO    บ         ณ/   \  ณ  ณณ/         รþþด                ~\ณณ  ณ  /   \ณ    ~ ~                          บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤณÜÜณฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/ ~    \    ~       ~                   ~บ
ECHO    บ  ~     /     ~   \ /ฤฤฤฤฤฤฤฤฯ ฺมมมมฟ ฯ      ฺฤฤฤฤฤฤฤฤฤ\ /         \    ~          ~                บ
ECHO    บ       /  ~       /ณ ~       ศอด uu รอผ      ณ ~\__Ü    ณ\          \                           ~   บ
ECHO    บ   ~  /          / ณ           ณ ~~ ณ~       ณ  /  ฿    ณ \  ~       \  ~ ~        ~           ~    บ
ECHO    บ ~   ณ\         /  ณ           ณ ~~ ณ\__Ü ~  ณ          ณ  \         /ณ     ~     ~                 บ
ECHO    บ     ณ  \  ~   /   ณ     ~ ~   ภยฤฤยู/  ฿    ณ  ~       ณ~  \  ~   /  ณ                        ~    บ
ECHO    บ ~   ณ    \~  /    ณ           ณบ  บ       ~ ณ          ณ    \   /    ณ                             บ
ECHO    บ     ณ      \/  /ณ ณ   ~    ~  ณบ  บ         ณ        ~ \ ณ\  \/      ณ           ~       ~         บ
ECHO    บ     ณ       ณ  ณณ/ ~      ~   ณ          ~  ณ  ~    ~   \ณณ ~ณ       ณ    ~   ~                   ~บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู     ~       ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ      ~ณ                       ~     บ
ECHO    บ      \      ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü  ~  ~~ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /  ~                           บ
ECHO    บ        \    ณ /~              ณ  /  ฿       ณ         ~    \ ณ ~  /           ~                    บ
ECHO    บ         ~\ ~ณ/                ณ    ~        ณ               \ณ  /        ~      ~                 ~บ
ECHO    บ      ~ ~   \/                 ณ             ณ                \/    ~     ~                    ~    บ
ECHO    บ                       ~       ณ    ~   ~~   ณ            ~      ~                   ~          ~   บ
ECHO    บ                               ณ             ณ       ~               ~~ ~    ~                      บ
ECHO    บ         ~                ~    ณ~    ~       ณ  ~                                                   บ
ECHO    บ           ~               ~   ณ ~           ณ                                ~     ~               บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE8TEXT
ECHO     %LASTBOSSNAME%: I AM %LASTBOSSNAMECAP%, THE MOST EVIL OF ALL THE DEMONS^^!
ECHO     IS PAEDOPHILLIA THAT SURPRISING FROM SOMEONE AS EVIL AS ME^^!?
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE9IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ    ~ ~                   ~ ~ฐฐฐฐ~              ~   ณ\          \                                   บ
ECHO    บ             ~              ~ฐฐฐฐ~  ~               ณ \          \     ~                            บ
ECHO    บ           _                ~ฐฐฐฐ~                  ณ  \        ~/ณ       ~                ~        บ
ECHO    บ         /~ \  /   /\ _     ~ฐฐฐฐ~          ~       ณ   \      /  ณ                    ~            บ
ECHO    บ ~       ณ~   ฤ  \     ณ  ~ ~~~~~~ ~   ~            ณ    \   / ~  ณ   ~                             บ
ECHO    บ    ~  ~ ณ /\   \/~ /ณ ณ        \฿฿/~ ~             ณ ณ\~ \/   /\ ณ       ~   ~            ~        บ
ECHO    บ         ณ/   \  ณ  ณณ/   ~     รþþด~     ~      ~  ~\ณณ  ณ ~/   \ณ              ~                  บ
ECHO    บ         /      \ณ  ณ/ฤฤฤฤฤฤฤฤฤฤณÜÜณฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \              ~                  บ
ECHO    บ        /         \ /ฤฤฤฤฤฤฤฤฯ ฺมมมมฟ ฯ      ฺฤฤฤฤฤฤฤฤฤ\ / ~       \ ~              ~               บ
ECHO    บ       /      ~   /ณ      ~  ศอด uu รอผ    ~ ณ~ \__Ü    ณ\          \          ~            ~       บ
ECHO    บ    ~ /     ~  ~ / ณ   ~       ณ ~~ ณ        ณ  /  ฿    ณ \       ~  \                        ~     บ
ECHO    บ     ณ\   ~     /  ณ           ณ ~~ ณ\__Ü    ณ~         ณ  \         /ณ        ~                ~   บ
ECHO    บ     ณ  \ ~  ~ / ~ ณ           ภยฤฤยู/~ ฿    ณ          ณ  ~\      /  ณ~           ~     ~          บ
ECHO    บ     ณ    \   /  ~ ณ           ณบ  บ         ณ ~        ณ    \   /    ณ                             บ
ECHO    บ     ณ      \/  /ณ ณ           ณบ ~บ         ณ ~  ~     \ ณ\  \/    ~ ณ     ~ ~             ~       บ
ECHO    บ     ณ      ~ณ  ณณ/~           ณ    ~      ~ ณ           \ณณ  ณ       ณ                         ~   บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤู             ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ~ ณ  ~    ณ                   ~   ~     บ
ECHO    บ      \   ~~ ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /  ~                ~          บ
ECHO    บ        \    ณ / ~    ~        ณ  /  ฿   ~   ณ              \ ณ    /                     ~          บ
ECHO    บ          \  ณ/                ณ   ~         ณ~              \ณ  /    ~                             บ
ECHO    บ          ~ \/            ~    ณ             ณ                \/  ~                          ~     ~บ
ECHO    บ      ~        ~     ~      ~ ~ณ     ~       ณ                                  ~ ~       ~         บ
ECHO    บ                           ~   ณ             ณ             ~     ~    ~            ~          ~     บ
ECHO    บ  ~~ ~                         ณ  ~        ~ ณ ~ ~     ~ ~~                 ~ ~  ~         ~        บ
ECHO    บ       ~  ~          ~         ณ             ณ           ~~                  ~                      บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ

ECHO.
GOTO :EOF
:SCENE9TEXT
ECHO     %PLAYERNAME%: Just stay away from her^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE10IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                       ~    ~ฐฐฐฐ~                 ~ณ\          \                                  ~บ
ECHO    บ                  ~         ~ฐฐฐฐ~~  ~     ~ ~     ~ณ \       ~  \                     ~ ~          บ
ECHO    บ           _      ~  ~      ~ฐฐฐฐ~          ~    ~ ~ณ  \         /ณ                 ~       ~ ~     บ
ECHO    บ         /  \  /   /\ _     ~ฐฐฐฐ~            ~~    ณ   \      /  ณ      ~                 ~        บ
ECHO    บ         ณ~   ฤ  \     ณ    ~~~~~~       ~          ณ    \   /    ณ    ~           ~                บ
ECHO    บ         ณ /\   \/  /ณ ณ    ~                ~      ณ ณ\  \/~  /\ ณ      ~          ~   ~           บ
ECHO    บ        ~ณ/   \  ณ  ณณ/                           ~  \ณณ  ณ  /   \ณ       ~                       ~ บ
ECHO    บ ~       /      \ณ~ ณ/ฤฤฤฤฤฤฤฤฤฤ\฿฿/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ/      \ ~          ~       ~            บ
ECHO    บ     ~  /   ~     \ /ฤฤฤฤฤฤฤฤฤฤฟรþþด         ฺฤฤฤฤฤฤฤฤฤ\ /         \    ~            ~   ~       ~  บ
ECHO    บ      ~/     ~    /ณ      ~    ณณÜÜณ      ~  ณ  \__Ü    ณ\          \                               บ
ECHO    บ     ~/          / ณ         ฯ ฺมมมมฟ ฯ    ~ ณ  /  ฿    ณ \          \      ~~                      บ
ECHO    บ     ณ\         /  ณ       ~ ศอด uu รอผ_Ü    ณ  ~  ~    ณ  \         /ณ     ~                  ~ ~  บ
ECHO    บ   ~ ณ  \      /   ณ           ณ ~~ ณ/ ~฿ ~ ~ณ ~        ณ   \      /  ณ     ~                  ~    บ
ECHO    บ     ณ    \   /    ณ   ~       ณ ~~ ณ        ณ          ณ    \   /    ณ   ~   ~    ~~      ~        บ
ECHO    บ     ณ      \/  /ณ ณ           ภยฤฤยู  ~   ~ ณ          \ ณ\  \/      ณ                 ~     ~    ~บ
ECHO    บ  ~  ณ       ณ  ณณ/            ณบ  บ         ณ           \ณณ  ณ       ณ         ~              ~    บ
ECHO    บ     ณ       ณ  ณ/ฤฤฤฤฤฤฤฤฤฤฤฤฤูบ ~บ       ~ ภฤฤฤฤฤฤฤฤฤฤฤฤ\ณ  ณ    ~  ณ        ~ ~       ~          บ
ECHO    บ   ~  \      ณ  /ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ  \__Ü       ฺฤฤฤฤฤฤฤฤฤฤฤฤฤ\  ณณ     /                            ~ บ
ECHO    บ        \~  ~ณ /     ~      ~  ณ ~/~ ฿       ณ      ~~     ~\ ณ    /       ~   ~                    บ
ECHO    บ   ~     ~\  ณ/   ~ ~        ~ ณ             ณ  ~            \ณ  /                              ~   บ
ECHO    บ  ~      ~~ \/              ~  ณ  ~          ณ   ~        ~ ~ \/    ~                               บ
ECHO    บ      ~     ~                  ณ             ณ                          ~~        ~                 บ
ECHO    บ                   ~        ~  ณ    ~  ~     ณ ~          ~       ~~                                บ
ECHO    บ ~                             ณ         ~ ~ ณ ~                    ~         ~ ~                 ~ บ
ECHO    บ      ~          ~        ~    ณ ~           ณ ~                                      ~             บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE10TEXT
ECHO     %LASTBOSSNAME%: NOPE.
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE11IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE11TEXT
ECHO     %LASTBOSSNAME% leaves through the portal with %GIRLNAME% over his shoulder
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE12IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE12TEXT
ECHO     (No, I'm not drawing that in ascii)
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE13IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE13TEXT
ECHO     %PLAYERNAME% can't stay awake any longer, and passes out...
SET /a WAITTIME = %BASEWAITTIME% + 7
GOTO :EOF

:SCENE14IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                 zฺฟบ
ECHO    บ                                                              ________________________          z ณณบ
ECHO    บ                                                             /                        \ฤฤฟ ฺฤฤฤฟ  ณณบ
ECHO    บ                                                            /                          \ ภฤด  ณณ  ณณบ
ECHO    บ                                                   ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                                   ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                                   รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE14TEXT
SET TEMPPATH=%MUSICPATH%\Maps\!%MAP%MUSICFOLDER!
SET /a STOP = 1
SET /a LOOP = 1
CALL "%MUSICPATH%\startmusic.bat"
ECHO     You wake up in a strange bed, in a room that you don't recognise
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE15IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                  ฺฟบ
ECHO    บ                                                              ________________________            ณณบ
ECHO    บ                                                             /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                                                            /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                                                   ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                                   ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                                   รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ณ                                               ณบ
ECHO    บ                                                   ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE15TEXT
ECHO     Voice: He's awake^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE16IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                       ล                                                                            บ
ECHO    บ                      /ณ\                                                                           บ
ECHO    บ                     /ฤฤฤ\                                                                          บ
ECHO    บ                     ณ  Oณ                                                                          บ
ECHO    บ                     ณ   ด                                                                          บ
ECHO    บ                     ภฟ ฺู                                                                        ฺฟบ
ECHO    บ                   ฺฤฤู ภฤฟ                                   ________________________            ณณบ
ECHO    บ                   ณ      ณ                                  /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                   ณ  ณ   ณ                                 /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                   ณ  ณ   ณ                        ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                   ณ  ณฤลฤณ                        รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณ                                               ณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณ                                               ณบ
ECHO    บ                   ณ  ณ   ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ภฤยฤฤยฤู                        ณ                                               ณบ
ECHO    บ                     ณ  ณ                          ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE16TEXT
ECHO     A robed man enters the room.
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE17IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                             ล                                                                      บ
ECHO    บ                            /ณ\                                                                     บ
ECHO    บ                           /ฤฤฤ\                                                                    บ
ECHO    บ                           ณ  Oณ                                                                    บ
ECHO    บ                           ณ   ด                                                                    บ
ECHO    บ                           ภฟ ฺู                                                                  ฺฟบ
ECHO    บ                         ฺฤฤู ภฤฟ                             ________________________            ณณบ
ECHO    บ                         ณ      ณ                            /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                         ณ  ณ   ณ                           /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                         ณ  ณ   ณ                  ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                         ณ  ณฤลฤณ                  รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณ                                               ณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณ                                               ณบ
ECHO    บ                         ณ  ณ   ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ภฤยฤฤยฤู                  ณ                                               ณบ
ECHO    บ                           ณ  ณ                    ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE17TEXT
ECHO     Robed Man: Hello my child. How are you feeling?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE18IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                             ล                                                                      บ
ECHO    บ                            /ณ\                                                                     บ
ECHO    บ                           /ฤฤฤ\                                                                    บ
ECHO    บ                           ณ  Oณ                                                                    บ
ECHO    บ                           ณ   ด                                                                    บ
ECHO    บ                           ภฟ ฺู                                                                  ฺฟบ
ECHO    บ                         ฺฤฤู ภฤฟ                             ________________________            ณณบ
ECHO    บ                         ณ      ณ                            /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                         ณ  ณ   ณ                           /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                         ณ  ณ   ณ                  ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                         ณ  ณฤลฤณ                  รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณ                                               ณบ
ECHO    บ                         ณ  ณ ณ ณ                  ณ                                               ณบ
ECHO    บ                         ณ  ณ   ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ณ      ณ                  ณ                                               ณบ
ECHO    บ                         ภฤยฤฤยฤู                  ณ                                               ณบ
ECHO    บ                           ณ  ณ                    ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE18TEXT
ECHO     %PLAYERNAME%: Where am I?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE19IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                   ล                                                                บ
ECHO    บ                                  /ณ\                                                               บ
ECHO    บ                                 /ฤฤฤ\                                                              บ
ECHO    บ                                 ณ  Oณ                                                              บ
ECHO    บ                                 ณ   ด                                                              บ
ECHO    บ                                 ภฟ ฺู                                                            ฺฟบ
ECHO    บ                               ฺฤฤู ภฤฟ                       ________________________            ณณบ
ECHO    บ                               ณ      ณ                      /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                               ณ  ณ   ณ                     /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                               ณ  ณ   ณ            ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                               ณ  ณ ณ ณ            ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                               ณ  ณฤลฤณ            รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                               ณ  ณ ณ ณ            ณ                                               ณบ
ECHO    บ                               ณ  ณ ณ ณ            ณ                                               ณบ
ECHO    บ                               ณ  ณ   ณ            ณ                                               ณบ
ECHO    บ                               ณ      ณ            ณ                                               ณบ
ECHO    บ                               ณ      ณ            ณ                                               ณบ
ECHO    บ                               ณ      ณ            ณ                                               ณบ
ECHO    บ                               ณ      ณ            ณ                                               ณบ
ECHO    บ                               ภฤยฤฤยฤู            ณ                                               ณบ
ECHO    บ                                 ณ  ณ              ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE19TEXT
ECHO     Robed Man: You're safe, can you tell me your name?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE20IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                         ล                                                          บ
ECHO    บ                                        /ณ\                                                         บ
ECHO    บ                                       /ฤฤฤ\                                                        บ
ECHO    บ                                       ณ  Oณ                                                        บ
ECHO    บ                                       ณ   ด                                                        บ
ECHO    บ                                       ภฟ ฺู                                                      ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ________________________            ณณบ
ECHO    บ                                     ณ      ณ                /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE20TEXT
ECHO     %PLAYERNAME%: %PLAYERNAME%...
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE21IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                         ล                                                          บ
ECHO    บ                                        /ณ\                                                         บ
ECHO    บ                                       /ฤฤฤ\                                                        บ
ECHO    บ                                       ณ  Oณ                                                        บ
ECHO    บ                                       ณ   ด                                                        บ
ECHO    บ                                       ภฟ ฺู                                                      ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ________________________            ณณบ
ECHO    บ                                     ณ      ณ                /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE21TEXT
ECHO     Robed Man: Hi %PLAYERNAME%, my name is %PRIESTNAME%
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE22IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                         ล                                                          บ
ECHO    บ                                        /ณ\                                                         บ
ECHO    บ                                       /ฤฤฤ\                                                        บ
ECHO    บ                                       ณ  Oณ                                                        บ
ECHO    บ                                       ณ   ด                                                        บ
ECHO    บ                                       ภฟ ฺู                                                      ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ________________________            ณณบ
ECHO    บ                                     ณ      ณ                /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE22TEXT
ECHO     %PRIESTNAME%: Can you tell me what happened %PLAYERNAME%
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE23IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                         ล                                                          บ
ECHO    บ                                        /ณ\                                                         บ
ECHO    บ                                       /ฤฤฤ\                                                        บ
ECHO    บ                                       ณ  Oณ                                                        บ
ECHO    บ                                       ณ   ด                                                        บ
ECHO    บ                                       ภฟ ฺู                                                      ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ________________________            ณณบ
ECHO    บ                                     ณ      ณ                /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE23TEXT
ECHO     %PLAYERNAME%: It was %LASTBOSSNAME%. He attacked our town
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE24IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                  ณ                 บ
ECHO    บ                                                                                  þ                 บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE24TEXT
ECHO     %PLAYERNAME%: %GIRLNAMECAP%^^!
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE25IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE25TEXT
ECHO     %PLAYERNAME%: He took %GIRLNAME% through a portal with him^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE26IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE26TEXT
ECHO     %PRIESTNAME%: Calm down %PLAYERNAME%, you've been unconscious for almost 6 days
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE27IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                  ณ                 บ
ECHO    บ                                                                                  þ                 บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE27TEXT
ECHO     %PLAYERNAME%: 6 DAYS^^!?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE28IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE28TEXT
ECHO     %PRIESTNAME%: Yes, you were very badly hurt when we found you. Luckily we found
ECHO     you when we did. I was able to perform the healing ritual and save your life.
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE29IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                  ?                 บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE29TEXT
ECHO     %PLAYERNAME%: Healing ritual?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE30IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE30TEXT
ECHO     %PRIESTNAME%: You'll find out soon enough my child, I have a feeling you'll be back
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE31IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE31TEXT
ECHO     %PLAYERNAME%: What happened to my town^^!?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE32IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE32TEXT
ECHO     %PRIESTNAME%: Which town are you from?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE33IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE33TEXT
ECHO     %PLAYERNAME%: %TOWN1NICKNAME%
SET /a WAITTIME = %BASEWAITTIME% + 1
GOTO :EOF

:SCENE34IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE34TEXT
ECHO     %PRIESTNAME%: I'm afraid it's not good news son, there's nothing left of %TOWN1NICKNAME%
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE35IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE35TEXT
ECHO     %PLAYERNAME%: What about my family?
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE36IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE36TEXT
ECHO     %PRIESTNAME%: We searched the entire town the day after %LASTBOSSNAME% attacked. There
ECHO     were no survivors...
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE37IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE37TEXT
ECHO     %PLAYERNAME%: We couldn't find anyone either. We think he may have taken them all with him^^!
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE38IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE38TEXT
ECHO     %PRIESTNAME%: If you're thinking about going after him, you can stop that right now. It's suicide
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE39IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE39TEXT
ECHO     %PLAYERNAME%: He's taken my entire life away from me. I have nothing else to live for.
ECHO     I have to at least try^^!
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE40IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ     ÛÛ         /                       \            ณณบ
ECHO    บ                                     ณ   ฤฤฤลฤฤฤฤฤÛÛ        /                         \           ณณบ
ECHO    บ                                     ณ      ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ    ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ   ฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ    ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ    ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE40TEXT
ECHO     %PRIESTNAME%: Ok, if you have to go, at least take these
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE41IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE41TEXT
ECHO     %PRIESTNAME% gives you %NUM1% !ITEM%ITEM1%NAME!s and %NUM2% !ITEM%ITEM2%NAME!s.
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE42IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE42TEXT
ECHO     %PRIESTNAME%: Here, take this cheery music too^^! It'll make you feel better
SET TEMPPATH=%MUSICPATH%\End
SET /a STOP = 1
SET /a LOOP = 1
CALL "%MUSICPATH%\startmusic.bat"
SET /a WAITTIME = %BASEWAITTIME% + 4
GOTO :EOF

:SCENE43IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE43TEXT
ECHO     %PLAYERNAME%: Yea^^! With music like this there's no way I can lose^^!
SET /a WAITTIME = %BASEWAITTIME% + 2
GOTO :EOF

:SCENE44IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE44TEXT
ECHO     %PRIESTNAME%: If you want to find %LASTBOSSNAME% you'll first need to get through the cave
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE45IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE45TEXT
ECHO     %PRIESTNAME%: Once you're through the cave, you'll need to enter the castle and search
ECHO     for a bookcase. There's a book in there that has information about opening portals to hell
SET /a WAITTIME = %BASEWAITTIME% + 5
GOTO :EOF

:SCENE46IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE46TEXT
ECHO     %PRIESTNAME%: From there you're on your own^^! This is the start of your adventure.
SET /a WAITTIME = %BASEWAITTIME% + 3
GOTO :EOF

:SCENE47IMAGE
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                ฺฤฤฤฟ               บ
ECHO    บ                                                                                ณO  ณ               บ
ECHO    บ                                         ล                                      ร   ณ               บ
ECHO    บ                                        /ณ\                                     ภฟ ฺู               บ
ECHO    บ                                       /ฤฤฤ\                                   ฺฤู ภฤฟ              บ
ECHO    บ                                       ณ  Oณ                                   ณ__   ณ              บ
ECHO    บ                                       ณ   ด                                  /   \  ณ              บ
ECHO    บ                                       ภฟ ฺู                                 /     \ ณ            ฺฟบ
ECHO    บ                                     ฺฤฤู ภฤฟ                 ______________/       \ณ            ณณบ
ECHO    บ                                     ณ      ณ                /                       \            ณณบ
ECHO    บ                                     ณ  ณ   ณ               /                         \           ณณบ
ECHO    บ                                     ณ  ณ   ณ      ฺฟ      /                           \          ณณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณณ     /                             \_ฺฤฤฤฤฤฤฟณณบ
ECHO    บ                                     ณ  ณฤลฤณ      รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ ณ ณ      ณ                                               ณบ
ECHO    บ                                     ณ  ณ   ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ณ      ณ      ณ                                               ณบ
ECHO    บ                                     ภฤยฤฤยฤู      ณ                                               ณบ
ECHO    บ                                       ณ  ณ        ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
GOTO :EOF
:SCENE47TEXT
ECHO     %PRIESTNAME%: Good luck %PLAYERNAME%^^!
GOTO :EOF





















