@ECHO OFF
:START
ECHO.
ECHO    ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                                                                                                    บ
ECHO    บ                       ล                                                                            บ
ECHO    บ                      /ณ\                                                                           บ
ECHO    บ                     /ฤฤฤ\                                                                          บ
ECHO    บ                     ณ  Oณ                                                                          บ
ECHO    บ                     ณ   ด                                                                          บ
ECHO    บ                     ภฟ ฺู                                                                        ฺฟบ
ECHO    บ                   ฺฤฤู ภฤฟ                                   ________________________            ณณบ
ECHO    บ                   ณ      ณ                                  /                        \ฤฤฟ ฺยฤฤฟ  ณณบ
ECHO    บ                   ณ  ณ   ณ                                 /                          \ ภฤด  Oณ  ณณบ
ECHO    บ                   ณ  ณ   ณ                        ฺฟ      /                            \ฺฤด   ณ  ณณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณณ     /                              \ฺภฤฤฤูฤฟณณบ
ECHO    บ                   ณ  ณฤลฤณ                        รมฤฤฤฤ/ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤมูณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณ                                               ณบ
ECHO    บ                   ณ  ณ ณ ณ                        ณ                                               ณบ
ECHO    บ                   ณ  ณ   ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ณ      ณ                        ณ                                               ณบ
ECHO    บ                   ภฤยฤฤยฤู                        ณ                                               ณบ
ECHO    บ                     ณ  ณ                          ภฤฤฤฤยฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤยฤฤฤฤฤูบ
ECHO    ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
pause