SET WORD=Guru
CALL "%MISCRESOURCEPATH%\calculateword.bat"
CLS
ECHO.
CALL "%MISCRESOURCEPATH%\displayword.bat"
ECHO.
ECHO   ษอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
ECHO   บ                                                                                 บ
ECHO   บ                                                                                 บ
ECHO   บ  ษอออออออออออออออออออออออออออออออออป                                            บ
ECHO   บ  บ                                 บ                                            บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ                                            บ
ECHO   บ  บ                                 บ             ฺฤฤฤฟ                          บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ             ณ  Oณ              ฺฤฤฤฟ       บ
ECHO   บ  บ                                 บ             ณ   ด              ณ/  ณ       บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ             ภยฤยู              ร   ณ       บ
ECHO   บ  บ                                 บ            ฺฤู ภฤฟ             ภยฤยู       บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ     ฺฤÜ    ณ     ณ            ฺฤู ภฤฟ      บ
ECHO   บ  บ                                 บ     ณฺ฿    ณ   ณ ณ            ณ     ณ      บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ  ฺฤฤมมฤฤฟ  ณ   ณ ณ            ณ ณ   ณ      บ
ECHO   บ  บ                                 บ  ณPetrolณ  ณ   ณ ณ       \ฤฤฤฤู ณ   ณ      บ
ECHO   บ  บ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ บ  ณ      ณ  ณ   ณ ณ        \\ฤฤฤฤฤฤฤ ณ      บ
ECHO   บ  บ                                 บ  ภฤฤฤฤฤฤู  ณ   ณ ณ         \\______/       บ
ECHO   ศอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
ECHO.
